[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [Prod - 326535729404 / FrontEnd Servers EC2-2368 ](https://app.env0.com/p/edba559d-ae7f-467d-a2f8-1b5a54709ead/environments/40774c06-1206-4fa1-a9ca-5970b3931b15):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] will be created
+   resource "aws_instance" "this" {
+       ami                                  = "ami-0bf3fc7dfe888c036"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_termination              = false
+       ebs_optimized                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3a.medium"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = false
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = "subnet-00d0e578ddbcd203b"
+       tags                                 = {
+           "Demo"                = "April 1"
+           "Name"                = "acme-luis"
+           "Owner"               = "acme demo org"
+           "Terraform"           = "true"
+           "Test"                = "new tag"
+           "env0_environment_id" = "40774c06-1206-4fa1-a9ca-5970b3931b15"
+           "env0_project_id"     = "edba559d-ae7f-467d-a2f8-1b5a54709ead"
        }
+       tags_all                             = {
+           "Demo"                = "April 1"
+           "Name"                = "acme-luis"
+           "Owner"               = "acme demo org"
+           "Terraform"           = "true"
+           "Test"                = "new tag"
+           "env0_environment_id" = "40774c06-1206-4fa1-a9ca-5970b3931b15"
+           "env0_project_id"     = "edba559d-ae7f-467d-a2f8-1b5a54709ead"
        }
+       tenancy                              = "default"
+       volume_tags                          = {
+           "Name"                = "acme-luis"
+           "env0_environment_id" = "40774c06-1206-4fa1-a9ca-5970b3931b15"
+           "env0_project_id"     = "edba559d-ae7f-467d-a2f8-1b5a54709ead"
        }
+       vpc_security_group_ids               = (known after apply)

+       credit_specification {
+           cpu_credits = "standard"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   instances  = [
+       (known after apply),
    ]
+   private_ip = [
+       (known after apply),
    ]
+   public_ip  = [
+       (known after apply),
    ]
```
</details>


```
Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$28 ($0.00 → $28)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: env0/acme-demo/.env0workdir/env0_tf_plan.json

+ module.acme-ec2.aws_instance.this[0]
  +$28

+     Instance usage (Linux/UNIX, on-demand, t3a.medium)
      +$27

+     root_block_device
    
+         Storage (general purpose SSD, gp2)
          +$0.80

Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$28 ($0.00 → $28)

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly estimate increased by $28 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ env0/acme-demo/.env0workdir/env0_tf_plan.json      ┃          +$28 ┃           - ┃         +$28 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/edba559d-ae7f-467d-a2f8-1b5a54709ead/environments/40774c06-1206-4fa1-a9ca-5970b3931b15/deployments/0c5d9b1b-b70a-4a83-9f06-2f4867f2ecba)
